rails-ground-up/app/controllers/things_controller.rb

	def index
		@things = Thing.all
---
SELECT "things".* FROM "things"

	def show
		@thing = Thing.find(params[:id])
---
SELECT "things".* FROM "things" WHERE "things"."id" = $1 LIMIT 1  [["id", "1"]]

	def create
		@thing = Thing.new(params[:thing])
		if @thing.save
---
INSERT INTO "things" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 21 Jun 2013 21:47:25 UTC +00:00], ["description", nil], ["name", "lal"], ["updated_at", Fri, 21 Jun 2013 21:47:25 UTC +00:00]]

	def update
		@thing = Thing.find(params[:id])
---
SELECT "things".* FROM "things" WHERE "things"."id" = $1 LIMIT 1  [["id", "1"]]

	def destroy
		@thing = Thing.find(params[:id])
		@thing.destroy
---
SELECT "things".* FROM "things" WHERE "things"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "things" WHERE "things"."id" = $1  [["id", 3]]